{
  "sections": {
    "template-header": {
      "type": "template-header",
      "disabled": true,
      "settings": {
        "full_width": true,
        "overlay_opacity": 30,
        "show_subcollections": true,
        "display_description": true
      }
    },
    "background_video_ENHKDL": {
      "type": "background-video",
      "settings": {
        "desktop_height": "desktop-height-450",
        "mobile_height": "mobile-height-350",
        "heading": "Our Story",
        "text": "",
        "video": "",
        "video_hosted": "shopify:\/\/files\/videos\/afghan-man-walking-on-a-large-afghan-rug.mp4",
        "button_text": "",
        "overlay_opacity": 25,
        "disable_top_spacing": true,
        "disable_bottom_spacing": true
      }
    },
    "image_with_text_slideshow_xf7R84": {
      "type": "image-with-text-slideshow",
      "blocks": {
        "slide_EE6QGb": {
          "type": "slide",
          "settings": {
            "image": "shopify:\/\/shop_images\/hamza-biking-in-san-francisco.jpg",
            "heading": "The Chargul Origin Story",
            "content": "Founded in 2023 by brothers Hamza and Emad, Chargul is a family-owned company dedicated to promoting cultural exchange and preserving the art of traditional Afghan rug weaving. While working in the tech industry, their passion for curating antique textiles and deep respect for specialized handiwork led them to create Chargul. Our mission is to raise cultural awareness of global artisanship, foster direct relationships with our skilled weavers, and bring the beauty of authentic Afghan rugs into American homes.",
            "button_text": "Shop Now",
            "button_link": ""
          }
        },
        "slide_KTcccg": {
          "type": "slide",
          "settings": {
            "image": "shopify:\/\/shop_images\/emad-biking-in-san-francisco.jpg",
            "heading": "Our Commitment to Quality and Ethics",
            "content": "With the help of friends and family, we personally source each handcrafted Afghan rug, guaranteeing that our products are ethically made, climate-friendly, and directly benefit the artisans. We take great pride in owning all parts of our supply chain, from the first threads to your doorstep, ensuring that the best sustainable craftsmanship reaches your home. Feel free to contact us to learn more about our commitment to quality, authenticity, and ethical sourcing of these magnificent Afghan rugs.",
            "button_text": "Shop Now",
            "button_link": ""
          }
        }
      },
      "block_order": [
        "slide_EE6QGb",
        "slide_KTcccg"
      ],
      "settings": {
        "mobile_height": "mobile-height-350",
        "desktop_height": "desktop-height-650",
        "desktop_image_width": "medium",
        "layout": "text_first",
        "content_position": "text-left",
        "full_width": false,
        "autoplay": true,
        "autoplay_length": 5,
        "disable_top_spacing": false,
        "disable_bottom_spacing": true
      }
    },
    "44591651-9ded-46de-9d9e-d5b49f3d07a3": {
      "type": "spacer",
      "settings": {
        "spacer_mobile": 10,
        "spacer_desktop": 35,
        "border_separator": false,
        "border_separator_full": false
      }
    },
    "2de833b4-ad01-4886-9e52-c1c0482d15e0": {
      "type": "spacer",
      "settings": {
        "spacer_mobile": 20,
        "spacer_desktop": 25,
        "border_separator": false,
        "border_separator_full": false
      }
    },
    "63f19bba-db6e-43b4-94f0-7b38720780ea": {
      "type": "spacer",
      "settings": {
        "spacer_mobile": 15,
        "spacer_desktop": 40,
        "border_separator": false,
        "border_separator_full": false
      }
    },
    "image_with_text_dpTcyA": {
      "type": "image-with-text",
      "blocks": {
        "heading_NJ76qW": {
          "type": "heading",
          "settings": {
            "text": "Our Products",
            "heading_size": "h3"
          }
        },
        "text_zFE3zY": {
          "type": "text",
          "settings": {
            "text": "<p>Chargul brings the vibrant culture and masterful artistry of Afghan craftsmen into American homes through our exquisite collection of hand-knotted Afghan wool rugs. Each piece in our collection exhibits stunning traditional designs and textures, carrying on centuries-old weaving traditions. By directly sourcing our rugs from skilled artisans, we provide them with a sustainable income and help preserve this specialized craft for future generations.<\/p><p>From the iconic Khal Mohammadi rugs, known for their rich red hues and intricate patterns, to the striking geometric designs of Baluchi carpets, our collection has something for every taste and style.<\/p><p>In addition to our signature Afghan rugs, we plan to expand our offerings to include a carefully curated selection of pillows, blankets, and other homeware items infused with global inspiration. However, our company's pride and heritage lie in promoting and sharing the magnificent art of the traditional Afghan rug, ensuring that these treasured pieces continue to be cherished for generations to come.<\/p>"
          }
        }
      },
      "block_order": [
        "heading_NJ76qW",
        "text_zFE3zY"
      ],
      "settings": {
        "image": "shopify:\/\/shop_images\/cushions-and-shawls-on-a-luxury-red-afghan-rug.png",
        "use_video": false,
        "video": "https:\/\/www.youtube.com\/watch?v=_9VUPq3SxOc",
        "video_autoplay": true,
        "height": "adapt",
        "desktop_image_width": "medium",
        "layout": "image_first",
        "content_position": "text-left",
        "full_width": false,
        "color_bg": "#ffffff",
        "color_text": "#103a3a",
        "disable_top_spacing": false,
        "disable_bottom_spacing": false
      }
    },
    "8da9adc5-bc9d-4ac9-922a-2d2399026926": {
      "type": "spacer",
      "settings": {
        "spacer_mobile": 0,
        "spacer_desktop": 0,
        "border_separator": true,
        "border_separator_full": true
      }
    },
    "collapsible_content_h3q43z": {
      "type": "collapsible-content",
      "blocks": {
        "collapsible_tab_EKDbWJ": {
          "type": "collapsible_tab",
          "settings": {
            "heading": "What's the inspiration behind Chargul?",
            "open": false,
            "content": "<p>Chargul was born from a deep love and appreciation for the timeless beauty and rich cultural heritage of Afghan textiles. Brothers Hamza and Emad, despite their immersion in the tech industry, found themselves captivated by the exquisite craftsmanship and historical significance of antique Afghan rugs. This passion grew into a mission to preserve and celebrate the artistry of Afghan weavers, culminating in the establishment of Chargul in 2023.<\/p><p>Each handcrafted Afghan rug tells a unique story through its intricate patterns and vibrant colors, transcending mere decoration to become a true work of art. Hamza and Emad recognized the importance of sharing these stories and traditions with the world, creating a platform that not only brings these stunning pieces into American homes but also shines a spotlight on the talented artisans behind them.<\/p><p>At its core, Chargul is driven by the belief that every Afghan rug is a treasure to be cherished and understood. By sharing the stories of the weavers and the rich traditions that inform their craft, Hamza and Emad aim to cultivate a deeper appreciation for Afghan textiles, ensuring that these time-honored practices continue to thrive and inspire future generations.<\/p>",
            "page": ""
          }
        },
        "collapsible_tab_EPQL9U": {
          "type": "collapsible_tab",
          "settings": {
            "heading": "What's your commitment to ethical sourcing?",
            "open": false,
            "content": "<p>Ethical sourcing is the beating heart of Chargul's business philosophy. We are unwavering in our dedication to ensuring that every Afghan rug we offer is not only a breathtaking work of art but also a product that directly supports the skilled artisans who create them. By fostering direct relationships with our weavers and eliminating intermediaries, we guarantee fair compensation and promote sustainable practices.<\/p><p>Our personal approach to sourcing each handmade Afghan rug, with the invaluable help of friends and family, allows us to ensure that our products are climate-friendly and directly benefit the artisans. By owning every aspect of our supply chain, we can confidently say that the entire journey, from the first threads to your doorstep, adheres to our rigorous standards of sustainability and ethical responsibility.<\/p><p>But our commitment goes beyond fair compensation. We strive to build lasting relationships with our weavers, providing them with the support and resources they need to continue their craft. This includes investing in their communities, promoting education, and ensuring safe working conditions. When you purchase an Afghan rug from Chargul, you are not only bringing a stunning piece of art into your home but also contributing to the well-being and sustainability of Afghan weaving traditions.<\/p>",
            "page": ""
          }
        },
        "collapsible_tab_JBUpq6": {
          "type": "collapsible_tab",
          "settings": {
            "heading": "CAN YOU TELL US MORE ABOUT THE EXPANSION OF YOUR PRODUCT RANGE?",
            "open": false,
            "content": "<p>While Afghan rug weaving has always been at the heart of Chargul's mission, we are thrilled to expand our product range to include a curated selection of other homeware items. Our future offerings will showcase pillows, blankets, and other home decor products infused with global inspiration, all chosen with the same dedication to quality and craftsmanship that defines our Afghan rugs.<\/p><p>Each new product will be a reflection of the cultural heritage and artisanal skills of the regions they hail from, ensuring that our commitment to supporting traditional craftsmanship extends far beyond Afghan rugs. By offering a wider range of products, we aim to infuse your home with the beauty and artistry of global handicrafts, creating a unique and culturally rich living space.<\/p><p>Our new product lines will be carefully curated to complement our Afghan rugs, allowing you to create a cohesive and elegant decor. Whether you are in search of a bold statement piece or a subtle accent, our expanded range will offer something for every taste and style. Keep an eye out for exciting updates as we continue to grow and bring you the finest in global home decor, all while maintaining our unwavering commitment to ethical sourcing and supporting traditional artisans.<\/p>",
            "page": ""
          }
        },
        "collapsible_tab_qRVWc3": {
          "type": "collapsible_tab",
          "settings": {
            "heading": "Explore More",
            "open": false,
            "content": "<h4>Discover Our Hand Knotted Afghan Rugs:<\/h4><p>Browse our exquisite collection of Hand Knotted Afghan Rugs, skillfully crafted in various sizes to suit any space:<\/p><ul><li><a href=\"https:\/\/www.chargul.com\/collections\/small-afghan-rugs\" title=\"Small Afghan Rugs\">Small Afghan Rugs<\/a><\/li><li><a href=\"https:\/\/www.chargul.com\/collections\/medium-afghan-rugs\" title=\"Medium Afghan Rugs\">Medium Afghan Rugs<\/a><\/li><li><a href=\"https:\/\/www.chargul.com\/collections\/large-afghan-rugs\" title=\"Large Afghan Rugs\">Large Afghan Rugs<\/a><\/li><li><a href=\"https:\/\/www.chargul.com\/collections\/x-large-afghan-rugs\" title=\"X-Large Afghan Rugs\">X-Large Afghan Rugs<\/a><\/li><li><a href=\"https:\/\/www.chargul.com\/collections\/afghan-rugs\" title=\"All Afghan Rugs\">All Afghan Rugs<\/a><\/li><\/ul><p><strong>Learn About the Artistry:<\/strong><em><strong> <\/strong><\/em>Delve into the rich history and intricate craftsmanship behind Afghan rugs on our <a href=\"https:\/\/www.chargul.com\/blogs\/blog-posts\" title=\"Chargul Blog Posts - Expert Insights on Hand Knotted Wool Rugs\">blog<\/a>.<br\/><strong>Our Story:<\/strong><em> <\/em><a href=\"https:\/\/www.chargul.com\/pages\/about-us\" title=\"Our Story\">Discover our journey <\/a>and commitment to preserving the legacy of Afghan rug-making.<br\/><strong>FAQ: <\/strong>Head over to the <a href=\"\/pages\/faq\" title=\"FAQ\">FAQ<\/a> section for answers to our most asked questions<br\/><strong>Personalized Assistance: <\/strong><a href=\"https:\/\/www.chargul.com\/pages\/contact\" title=\"Contact\">Contact us<\/a> for personalized assistance in selecting the ideal rug for your home.<\/p>",
            "page": ""
          }
        }
      },
      "block_order": [
        "collapsible_tab_EKDbWJ",
        "collapsible_tab_EPQL9U",
        "collapsible_tab_JBUpq6",
        "collapsible_tab_qRVWc3"
      ],
      "settings": {
        "heading": "Chargul's Journey and Mission",
        "description": "",
        "disable_top_spacing": false,
        "disable_bottom_spacing": false
      }
    },
    "featured_collection_zPd4A7": {
      "type": "featured-collection",
      "blocks": {
        "collection_Tm8rnw": {
          "type": "collection",
          "settings": {
            "collection": "afghan-rugs",
            "display_type": "grid",
            "product_limit": 4,
            "columns_desktop": 4,
            "show_view_all": true,
            "button_outline": false,
            "mobile_swipe": true
          }
        }
      },
      "block_order": [
        "collection_Tm8rnw"
      ],
      "settings": {
        "heading": "Newly Curated Rugs",
        "description": "<p>Discover the latest additions to our exquisite Afghan rug gallery<\/p>",
        "full_width": false,
        "disable_top_spacing": true,
        "disable_bottom_spacing": false
      }
    }
  },
  "order": [
    "template-header",
    "background_video_ENHKDL",
    "image_with_text_slideshow_xf7R84",
    "44591651-9ded-46de-9d9e-d5b49f3d07a3",
    "2de833b4-ad01-4886-9e52-c1c0482d15e0",
    "63f19bba-db6e-43b4-94f0-7b38720780ea",
    "image_with_text_dpTcyA",
    "8da9adc5-bc9d-4ac9-922a-2d2399026926",
    "collapsible_content_h3q43z",
    "featured_collection_zPd4A7"
  ]
}
